package day13;
/*
 * 2016_11_21
 * 
 * 
 * 객체지향의 장점
 *  - 재활용이 용이하다.
 *  - 관리가 용이하다.
 *  
 *  OOP 란?
 *  Object Oriented Programming 의 약자
 * 
 * 객체지향 프로그래밍(OOP) 의 4대 특징
 *  1. 추상화
 *  2. 캡슐화 (은닉화) -> 권한을 최소화
 *  3. 다형성 -> 다양한 형태의 성질로 사용
 *  4. 상속성
 *  
 *  추상화 (Abstraction) 란 ?
 *   - 객체 모델링(설계) -> 값(멤버 변수)			ex) 모니터 : 모델명, 크기 ..
 *   				    -> 행위(멤버 메소드)		ex) 모니터 : 출력
 *      => 내가 사용해야하는 값과 행위를 추출하는 행위.
 *       *변수 종류 
 *        맴버 변수(전역 변수)   ***static 멤버 변수 -> 모든 객체 끼리 정보 공유 -> 프로그램 시작시 정적 메모리 할당이기 때문에 미리 초기화를 해주어야 한다.
 *        클래스 변수(전역 변수)
 *        지역 변수
 *      
 *   - 어떠한 물체(Object) 를 대상으로 주 가되는 특징을
 *     강조하여 표현하고, 그 외 나머지 부분은 과감하게 생략하는 것.
 *  
 *  
 *  생성자 란 ?
 *   - 클래스를 객체로 만들때 해당 객체의 멤버 변수들을 초기화 해주는 역할의 메소드
 *   - 형식
 *   
 *     접근지정자 생성자명(){ -> public
 *     	 초기화 과정;
 *     }
 *   - 자바는 소멸자가 없다.
 */

public class Day13_01 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}













