package html_12_19;
/*
 * 2016_12_19
 * HTML 문서의 기본구조
 * <html> -> 문서의 시작
 *  <head> -> 문서의 머리부분
 *   <title> 문서의 제목 </title>
 *  </head>
 *  <body>
 *   		문서의 몸부분
 *  </body>
 * </html> -> 문서의 종료
 * 
 * HTML 문서의 특징
 *  1. 태그 명령어는 대/소 문자를 가리지 않는다.
 *  2. 명령어는 대부분 짝을 이루고 있다 ex) <font></font>
 *  3. 두가지 이상 명령어를 쓸 때는 대칭으로 쓰여진다.
 *  
 * HTML의 특수문자
 * 
 * 특수문자			| 실제 보여주는 결과
 * ------------------------------------
 * &nbsp;			| 공백
 * &quot;			| "
 * &copy;			| ©
 * &amp;			| &
 * &lt; or &gt;		| < or >
 * &#48 ~ &#57		| 0 ~ 9
 * &#65 ~ &#90;		| A ~ z
 * &#97 ~ &#122;	| a ~ z
 * &#64;			| @
 * 
 * 주석 기능
 *  <!-- 주석 내용 -->
 * 
 * 블록 태그
 *  - 한줄을 모두 차지한다.
 * 인라인 태그
 *  - 컨탠츠의 크기만큼 차지한다.
 *  
 * 물리 태그
 *  - 기능이 바로 적용되는 태그
 * 속성 태그
 *  - 속성을 통해 적용되는 태그
 *  
 *  
 */
public class Html {

}
