package html_12_21;
/*
 * CSS 란?
 *  속성으로만 이루어진 언어
 *  
 * CSS의 정의 
 *  1. 인라인
 *  2. 임베디드
 *   - 사용해야 되는 css를 페이지 상단에 선언
 *  3. 익스터널
 *   - 반복적으로 사용해야 되는 css를 별도의 외부 파일로 저장해서 불러오는 방식
 * 
 * CSS의 선언
 *  1. 태그 선택자
 *   태그로 묶인 컨탠츠들 전체에 적용하는 방법 
 *   ex) 태그명 {}, b {}
 *  2. 클래스 선택자
 *   태그에 class 이름을 지정하여 해당 클래스를 선택하여 css를 적용
 *   ex) .클래스명 {}, .t1 {}
 *  3. ID 선택자
 *  
 *  선택자{
 *   속성: 속성값;
 *   속성: 속성값;
 *      .
 *      .
 *      n
 *  }
 */
public class Css {

}
